<?xml version="1.0" ?>
<net name="human-pose-estimation-0001" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,256,456"/>
			<output>
				<port id="0" names="data" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_8635_const296_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,1,1,1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_8637_const298_const" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="1,3,1,1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="20912095_const" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="6" name="20922096_const" type="Const" version="opset1">
			<data element_type="f16" offset="10" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="7" name="20932097_const" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="8" name="20942098_const" type="Const" version="opset1">
			<data element_type="f16" offset="10" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="9" name="conv1/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv1/bn/mean/Fused_Mul_95529554_const3004132/quantized5339_const" type="Const" version="opset1">
			<data element_type="i8" offset="12" shape="32,3,3,3" size="864"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv1/bn/mean/Fused_Mul_95529554_const3004132/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv1/fq_weights_1/zero_point5352_const" type="Const" version="opset1">
			<data element_type="f16" offset="876" shape="32,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv1/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv1/fq_weights_1/scale5347_const" type="Const" version="opset1">
			<data element_type="f16" offset="940" shape="32,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv1/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv1" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_864086458986/EltwiseUnsqueeze9146_const302_const" type="Const" version="opset1">
			<data element_type="f16" offset="1004" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="relu1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="18311835_const" type="Const" version="opset1">
			<data element_type="f16" offset="1068" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="18321836_const" type="Const" version="opset1">
			<data element_type="f16" offset="1132" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="18331837_const" type="Const" version="opset1">
			<data element_type="f16" offset="1068" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="18341838_const" type="Const" version="opset1">
			<data element_type="f16" offset="1132" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv2_1/dw/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="1412914132_const3054134/quantized4787_const" type="Const" version="opset1">
			<data element_type="i8" offset="1196" shape="32,1,3,3" size="288"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="1412914132_const3054134/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2_1/dw/fq_weights_1/zero_point4800_const" type="Const" version="opset1">
			<data element_type="f16" offset="1484" shape="32,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv2_1/dw/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2_1/dw/fq_weights_1/scale4795_const" type="Const" version="opset1">
			<data element_type="f16" offset="1548" shape="32,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv2_1/dw/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="7108/value7110_const" type="Const" version="opset1">
			<data element_type="i64" offset="1612" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="7108" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv2_1/dw" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_864886538988/EltwiseUnsqueeze9154_const307_const" type="Const" version="opset1">
			<data element_type="f16" offset="1652" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2_1/dw" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="relu2_1/dw" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv2_1/dw" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="12711275_const" type="Const" version="opset1">
			<data element_type="f16" offset="1716" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="38" name="12721276_const" type="Const" version="opset1">
			<data element_type="f16" offset="1718" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="39" name="12731277_const" type="Const" version="opset1">
			<data element_type="f16" offset="1716" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="40" name="12741278_const" type="Const" version="opset1">
			<data element_type="f16" offset="1718" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="41" name="conv2_1/sep/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv2_1/sep/bn/mean/Fused_Mul_95609562_const3104136/quantized5819_const" type="Const" version="opset1">
			<data element_type="i8" offset="1720" shape="64,32,1,1" size="2048"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv2_1/sep/bn/mean/Fused_Mul_95609562_const3104136/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv2_1/sep/fq_weights_1/zero_point5832_const" type="Const" version="opset1">
			<data element_type="f16" offset="3768" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv2_1/sep/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv2_1/sep/fq_weights_1/scale5827_const" type="Const" version="opset1">
			<data element_type="f16" offset="3896" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv2_1/sep/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv2_1/sep" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_865686618990/EltwiseUnsqueeze9162_const312_const" type="Const" version="opset1">
			<data element_type="f16" offset="4024" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv2_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2_1/sep" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="relu2_1/sep" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv2_1/sep" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="10711075_const" type="Const" version="opset1">
			<data element_type="f16" offset="4152" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="10721076_const" type="Const" version="opset1">
			<data element_type="f16" offset="4280" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="10731077_const" type="Const" version="opset1">
			<data element_type="f16" offset="4152" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="10741078_const" type="Const" version="opset1">
			<data element_type="f16" offset="4280" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv2_2/dw/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="1412514128_const3154138/quantized4811_const" type="Const" version="opset1">
			<data element_type="i8" offset="4408" shape="64,1,3,3" size="576"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="1412514128_const3154138/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv2_2/dw/fq_weights_1/zero_point4824_const" type="Const" version="opset1">
			<data element_type="f16" offset="4984" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv2_2/dw/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv2_2/dw/fq_weights_1/scale4819_const" type="Const" version="opset1">
			<data element_type="f16" offset="5112" shape="64,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv2_2/dw/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="7116/value7118_const" type="Const" version="opset1">
			<data element_type="i64" offset="5240" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="7116" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv2_2/dw" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_866486698992/EltwiseUnsqueeze9170_const317_const" type="Const" version="opset1">
			<data element_type="f16" offset="5280" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv2_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2_2/dw" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="relu2_2/dw" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv2_2/dw" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="21312135_const" type="Const" version="opset1">
			<data element_type="f16" offset="1716" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="70" name="21322136_const" type="Const" version="opset1">
			<data element_type="f16" offset="5408" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="71" name="21332137_const" type="Const" version="opset1">
			<data element_type="f16" offset="1716" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="72" name="21342138_const" type="Const" version="opset1">
			<data element_type="f16" offset="5408" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="73" name="conv2_2/sep/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv2_2/sep/bn/mean/Fused_Mul_95689570_const3204140/quantized5411_const" type="Const" version="opset1">
			<data element_type="i8" offset="5410" shape="128,64,1,1" size="8192"/>
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv2_2/sep/bn/mean/Fused_Mul_95689570_const3204140/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv2_2/sep/fq_weights_1/zero_point5424_const" type="Const" version="opset1">
			<data element_type="f16" offset="13602" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv2_2/sep/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv2_2/sep/fq_weights_1/scale5419_const" type="Const" version="opset1">
			<data element_type="f16" offset="13858" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv2_2/sep/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv2_2/sep" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_867286778994/EltwiseUnsqueeze9178_const322_const" type="Const" version="opset1">
			<data element_type="f16" offset="14114" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv2_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2_2/sep" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="relu2_2/sep" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv2_2/sep" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="19111915_const" type="Const" version="opset1">
			<data element_type="f16" offset="14370" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="19121916_const" type="Const" version="opset1">
			<data element_type="f16" offset="14626" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="19131917_const" type="Const" version="opset1">
			<data element_type="f16" offset="14370" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="19141918_const" type="Const" version="opset1">
			<data element_type="f16" offset="14626" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv3_1/dw/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="1409714100_const3254142/quantized5195_const" type="Const" version="opset1">
			<data element_type="i8" offset="14882" shape="128,1,3,3" size="1152"/>
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="1409714100_const3254142/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv3_1/dw/fq_weights_1/zero_point5208_const" type="Const" version="opset1">
			<data element_type="f16" offset="16034" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv3_1/dw/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv3_1/dw/fq_weights_1/scale5203_const" type="Const" version="opset1">
			<data element_type="f16" offset="16290" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv3_1/dw/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="7136/value7138_const" type="Const" version="opset1">
			<data element_type="i64" offset="16546" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="7136" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="conv3_1/dw" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="data_add_868086858996/EltwiseUnsqueeze9186_const327_const" type="Const" version="opset1">
			<data element_type="f16" offset="16586" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="conv3_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv3_1/dw" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="relu3_1/dw" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv3_1/dw" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="991995_const" type="Const" version="opset1">
			<data element_type="f16" offset="1716" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="102" name="992996_const" type="Const" version="opset1">
			<data element_type="f16" offset="16842" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="103" name="993997_const" type="Const" version="opset1">
			<data element_type="f16" offset="1716" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="104" name="994998_const" type="Const" version="opset1">
			<data element_type="f16" offset="16842" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="105" name="conv3_1/sep/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv3_1/sep/bn/mean/Fused_Mul_95769578_const3304144/quantized5771_const" type="Const" version="opset1">
			<data element_type="i8" offset="16844" shape="128,128,1,1" size="16384"/>
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="conv3_1/sep/bn/mean/Fused_Mul_95769578_const3304144/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="conv3_1/sep/fq_weights_1/zero_point5784_const" type="Const" version="opset1">
			<data element_type="f16" offset="33228" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="conv3_1/sep/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="conv3_1/sep/fq_weights_1/scale5779_const" type="Const" version="opset1">
			<data element_type="f16" offset="33484" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="conv3_1/sep/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="conv3_1/sep" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="data_add_868886938998/EltwiseUnsqueeze9194_const332_const" type="Const" version="opset1">
			<data element_type="f16" offset="33740" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="conv3_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv3_1/sep" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="relu3_1/sep" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv3_1/sep" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="16111615_const" type="Const" version="opset1">
			<data element_type="f16" offset="14370" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="16121616_const" type="Const" version="opset1">
			<data element_type="f16" offset="33996" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="16131617_const" type="Const" version="opset1">
			<data element_type="f16" offset="14370" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="16141618_const" type="Const" version="opset1">
			<data element_type="f16" offset="33996" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="conv3_2/dw/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="1410114104_const3354146/quantized5915_const" type="Const" version="opset1">
			<data element_type="i8" offset="34252" shape="128,1,3,3" size="1152"/>
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="1410114104_const3354146/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="conv3_2/dw/fq_weights_1/zero_point5928_const" type="Const" version="opset1">
			<data element_type="f16" offset="35404" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="conv3_2/dw/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="conv3_2/dw/fq_weights_1/scale5923_const" type="Const" version="opset1">
			<data element_type="f16" offset="35660" shape="128,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="conv3_2/dw/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="7100/value7102_const" type="Const" version="opset1">
			<data element_type="i64" offset="16546" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
